#include <iostream>
using namespace std;


//Задачи
//Важно!За решаването на задачите е да се ползват само нещата, които са взети на семинар до този момент.
//Т.е за решаването на тези задачи не се позволява if / while и тн.


//Задача 1: Въвежда се цяло число.Отпечатайте 1, ако числото е четно и 0, ако е нечетно.
//Вход : 265, Изход : 0
//Вход : 290, Изход : 1

//int main()
//{
//    int x;
//    cin >> x;
//    int y = (x % 2 + 1) % 2;
//    cout << y;
//}

//Задача 2 : Въвежда се трицифрено цяло число n.Да се отпечата обърнатото число събрано с единица.
//Вход : 265, Изход : 563
//Вход : 289, Изход : 983
//

//int main() {
//	int x;
//	int y = 0;
//	cin >> x;
//	y += (x % 10) * 100 + ((x % 100) / 10) * 10 + x / 100 + 1;
//	cout << y;
//}

//Задача 3 : Въвежа се символ.Да се отпечата 1, ако е английска гласна буква, и 0, ако не е.
//Вход : а, Изход : 1
//Вход : Е, Изход : 1
//Вход : В, Изход : 0
//

//int main() {
//	char ch;
//	cin >> ch;
//	cout << (ch >= 'a' && ch <= 'z') || (ch >= 'A' && ch <= 'Z');
//}

//Задача 4 : Въвежа се цяло число.Да се отпечата 1, ако числото е валидна оценка от училище, и 0, ако не е валидна.
//Вход : 5, Изход : 1
//Вход : 3, Изход : 1
//Вход : 9, Изход : 0
//

//int main() {
//	int x;
//	cin >> x;
//	cout << ((x >= 2) && (x <= 6));
//}

//Задача 5 : Въвежа се цяло число.Да се отпечата без последната цифра.
//Вход : 513, Изход : 51
//Вход : 1234, Изход : 123
//

//int main() {
//	int x;
//	cin >> x;
//	cout << x / 10;
//}
// 
//Задача 6 : Напишете програма, която въвежда две числа - a и b и извежда като резултат(a + b) ^ 4 - (a - b) ^ 2
//Вход : 5 7, Изход : 20732
//
//int main() {
//	int x, y;
//	cin >> x >> y;
//	cout << ((x + y) * (x + y) * (x + y) * (x + y) - (x - y) * (x - y));
//}
// 
//Задача 7 : Въвежда се цяло число n - n лева.Да се изведе на конзолата как може да се разпределят по банкноти, така че да имаме минимален брой банкноти.
//В условието приемаме, че имаме банкноти от 1 и 2 лева.
//Вход : 193, Изход : 1x100lv 1x50lv 2x20lv 0x5lv 1x2lv 1x1lv
//
//int main() {
//	int x;
//	cin >> x;
//	int curr = x;
//	cout << curr/100 << endl;
//	curr %= 100;
//	cout << curr / 50 << endl;
//	curr %= 50; 
//	cout << curr / 20 << endl;
//	curr %= 20; 
//	cout << curr / 10 << endl;
//	curr %= 10;
//	cout << curr / 5 << endl;
//	curr %= 5;
//	cout << curr / 2 << endl;
//	curr %= 2; 
//	cout << curr / 1 << endl;
//}

//Задача 8 : Въвеждат се две числа.Да се отпечата по - голямото от двете.
//Вход : 265, 44, Изход : 265

//int main() {
//	int x, y;
//	cin >> x >> y;
//	cout << ((x - y) > 1) * x + ((y - x) > 1) * y;
//}
