#include <iostream>
using namespace std;

//Задачи
//Задача 1: Да се напише програма, която въвежда цяло число отпечатава с думи кой ден от седмицата е.
//Вход : 1, Изход : Monday
//Вход : 5, Изход : Friday
//Вход : 250, Изход : Invalid day!
//

//int main() {
//	int x;
//	cin >> x;
//	switch (x) {
//	case 1:cout << "Monday"; break;
//	case 2:cout << "Tuesday"; break;
//	case 3:cout << "Wednesday"; break;
//	case 4:cout << "Thursday"; break;
//	case 5:cout << "Friday"; break;
//	case 6:cout << "Saturday"; break;
//	case 7:cout << "Sunday"; break;
//	default:cout << "error";
//	}
//}

//Задача 2 (Between 100 and 200) : Да се напише програма, която въвежда цяло число и проверява дали е под 100, между 100 и 200 или над 200.
//Да се отпечатат съответно съобщения като в примерите по - долу :
//Вход : 95, Изход : Less than 100
//Вход : 120, Изход : Between 100 and 200
//Вход : 250, Изход : Greater than 200
//

//int main() {
//	int x;
//	cin >> x;
//	if (x < 100) {
//		cout << "Less than 100";
//	}
//	else if (x > 200) {
//		cout << "Greater than 200";
//	}
//	else {
//		cout << "Between 100 and 200";
//	}
//}

//Задача 3 (Speed trap) : Да се напише програма, която въвежда скорост(десетично число) и отпечатва информация за скоростта.
//При скорост до 10 (включително)отпечатайте “slow”.При скорост над 10 и до 50 отпечатайте “average”.
//При скорост над 50 и до 150 отпечатайте “fast”.При скорост над 150 и до 1000 отпечатайте “ultra fast”.
//При по - висока скорост отпечатайте “extremely fast”
//Вход : 8, Изход : slow
//Вход : 49.5, Изход : average
//Вход : 126, Изход : fast
//Вход : 3500, Изход : extremely fast
// 

//int main() {
//	double x;
//	cin >> x;
//	if (x < 10) {
//		cout << "slow";
//	}
//	else if (x < 50) {
//		cout << "average";
//	}
//	else if (x < 150) {
//		cout << "fast";
//	}
//	else {
//		cout << "extremely fast";
//	}
//}

//Задача 4 (Лице на фигура) : Да се напише програма, която въвежда размерите на геометрична фигура и пресмята лицето й.
//Фигурите са четири вида : квадрат(s), правоъгълник(r), кръг(c) и триъгълник(triangle).
//На първия ред на входа се чете вида на фигурата(square, rectangle, circle или triangle).
//Ако фигурата е квадрат, на следващия ред се чете едно число – дължина на страната му.
//Ако фигурата е правоъгълник, на следващите два реда четат две числа – дължините на страните му.
//Ако фигурата е кръг, на следващия ред чете едно число – радиусът на кръга.
//Ако фигурата е триъгълник, на следващите два реда четат две числа – дължината на страната му и дължината на височината към нея.
//Резултатът да се закръгли до 3 цифри след десетичната точка
//Вход : s 5, Изход : 25
//Вход : r 7 2.5, Изход : 17.5
//Вход : c 6, Изход : 113.097
//

//int main() {
//	char ch;
//	cin >> ch;
//	if (ch == 's') {
//		double a;
//		cin >> a;
//		cout << a * a;
//	}
//	else if (ch == 'r') {
//		double a, b;
//		cin >> a >> b;
//		cout << a * b;
//	}
//	else if (ch == 'c') {
//		double a;
//		cin >> a;
//		cout << a * a * 3.14;
//	}
//	else if (ch == 't') {
//		double a, b, c;
//		cin >> a >> b >> c;
//		double half = (a + b + c) / 2;
//		cout << sqrt(half * (half - a) * (half - b) * (half - c));
//	}
//}

//Задача 5 (Време + 15 минути) : Да се напише програма, която въвежда час и минути от 24 - часово денонощие и изчислява колко ще е часът след 15 минути.
//Резултатът да се отпечата във формат hh : mm.Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. 
//Часовете и минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо
//Вход : 1 46, Изход : 02 : 01
//Вход : 0 1, Изход : 00 : 16
//Вход : 23 59, Изход : 00 : 14
//

//int main() {
//	int min, hour;
//	cin >> hour >> min;
//	min += 15;
//	if (min > 59) {
//		min %= 60;
//		hour++;
//		if (hour > 23) {
//			hour = 0;
//		}
//	}
//	cout << hour << ":" << min;
//}

//Задача 6 : Да се напише програма, която при подадени радиус r и двумерна точка(х, у) 
//проверява дали точката се намира вътре / извън или по контура на окръжност с център(0, 0).
//Вход : 5 0 5, Изход : On the circle
//Вход : 5 10 30, Изход : Out of the circle
//Вход : 5 0 2, Изход : In the circle
//
//int main() {
//	int rad;
//	int x, y;
//	cin >>rad>> x >> y;
//	int dist = sqrt(x * x + y * y);
//	if (dist == rad) {
//		cout << "On the circle";
//	}
//	else if (dist < rad) {
//		cout << "In the circle";
//	}
//	else {
//		cout << "Out of the circle";
//	}
//}